const GANNT_DATA = {
  data: [
    {
      样车序号: "1v1",
      配置: "配置2",
      试验负责人: "樊庆东",
      试验开始时间: "2024-04-26",
      漆后车身返回计划: null,
      上线计划: "2024-11-29",
      下线计划: "2024-12-02",
      交付计划: "2024-12-02",
      试验结束时间: "2024-04-30 ",
      需求提出人: "杜尔复",
      备注: "",
      index: 0,
      pageIndex: 0,
      漆前车身需求计划: "2024-11-28",
      一次电检: "2024-12-02",
      二次电检: "2024-12-02",
      底盘: "2024-12-02",
      漆后车身需求计划: "2024-11-08",

      id: "id1",
      text: "text1",
      start_date: "2024-10-26 00:00:00",
      duration: 10,
      completed: false,
    },

    {
      样车序号: "1v1",
      配置: "配置2",
      试验负责人: "樊庆东",
      一次电检: "2024-12-02",

      id: "id1-1",
      parent: "id1",
      text: "text1-1",
      start_date: "2024-10-28 00:00:00",
      duration: 2,
      completed: false,
    },

    {
      样车序号: "1v1",
      配置: "配置2",
      试验负责人: "樊庆东",
      二次电检: "2024-12-02",

      id: "id1-2",
      parent: "id1",
      text: "text1-2",
      start_date: "2024-11-4 00:00:00",
      duration: 2,
      completed: false,
    },

    {
      样车序号: "1v2",
      配置: "配置2",
      试验负责人: "杨慧凯",
      试验开始时间: "2024-04-27",
      漆后车身返回计划: null,
      上线计划: "2024-12-02",
      下线计划: "2024-12-03",
      交付计划: "2024-12-03",
      试验结束时间: "2024-05-01",
      需求提出人: "杜尔复",
      备注: "",
      index: 1,
      pageIndex: 1,
      漆前车身需求计划: "2024-11-29",
      一次电检: "2024-12-03",
      二次电检: "2024-12-03",
      底盘: "2024-12-03",
      漆后车身需求计划: "2024-11-20",

      id: "id2",
      text: "text2",
      start_date: "2024-11-8 00:00:00",
      duration: 18,
      completed: true,
      progress: 0.6,
    },
  ],
};

const data = {
  data: [
    {
      id: 1,
      text: "Task #1",
      start_date: "2019-04-15 00:00:00",
      duration: 3,
      progress: 0.6,
    },
    {
      id: 2,
      text: "Task #21",
      start_date: "2019-04-18 00:00:00",
      duration: 3,
      progress: 0.4,
    },
  ],
  links: [{ id: 1, source: 1, target: 2, type: "0" }],
};

export { GANNT_DATA, data };
